{"author": "Elliot Hogg", "subject": "LP", "tags":["Electronic","Experimental","2013","Germany","Berlin","Psycadelic","Editions Mego","The Humble Bee"], "artist":["The Humble Bee"], "label":"Editions Mego", "title":"The Humble Bee", "player":"<iframe  class=\"embed-responsive-item\"  width=\"2%\" height=\"2%\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?url=https%3A\/\/api.soundcloud.com\/tracks\/34080018&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;visual=true\"></iframe>", "body":"Craig Tattersal returns with his first ever vinyl transmission as ‘The Humble Bee’. The project stemmed out a visit to Cornwall in November 2011, in which Tattersal made various recordings of the environment. Tattersal arranges these recordings, and fills the space between them with dreamy analogue overlays. Highly recommended. More information about Tattersal’s trip can be found here. To purchase the LP click here.", "tagline":"The piece beautifully combines sonic recordings of Tattersal’s experience, alongside an emotional representation in the form of musical composition."}
{"author": "Elliot Hogg", "subject":"LP", "tags" : ["Electronic","Experimental","2013","Germany","Berlin","Psycadelic","Editions Mego","Bauteile"],"artist":["Atom TM", "Marc Behrens"], "title":"Atom TM and Marc Behrens - Bauteile", "image":"http:\/\/assets.boomkat.com\/images\/846842\/333.jpg", "body":"Atom & Marc Behrens come together to sonically combine their extensive investigations into contemporary music. Some of the recordings used reach as far back as 1987, highlighting the extent and depth of this project. You can listen to a 5-minute excerpt through the links below:\n\n\t https:\/\/soundcloud.com\/editionsmego\/atom-tm-and-marc-behrens\n\n \t https:\/\/soundcloud.com\/editionsmego\/atom-tm-and-marc-behrens-1 \n\nHowever if you have an hour to spare (I know you do), take a full listen. CD \/ Digital available here.\n\n\t http:\/\/boomkat.com\/downloads\/937885-atom-tm-marc-behrens-bauteile","tagline":"A 70 minute journey through time..."}
{"author": "SD", "subject":"EP", "tags" : ["SD", "Ninja Tune", "London", "2014", "House", "Electronic", "EP","Martyn", "Four tet"], "artist":["Martyn", "Four tet"], "label":"Text", "title":"Martyn + Four tet - Forgiveness EP Review", "player":"<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https:\/\/w.soundcloud.com\/player\/?url=https%3A\/\/api.soundcloud.com\/tracks\/147380962&amp;color=ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false\"><\/iframe>", "body":"As the glockenspiel skips out playfully over the opening bars it already feels like Martyn’s onto a winner with his latest EP. On ‘Glassbeadgames’, his and fellow producer Four Tet’s ability to present raw eclectic rhythms and grooves is combined with an astute adherence to fantastic production values. The vocals interject effortlessly over the rhythm and brilliantly simple bass line, evoking all those raving memories of yesteryear.<br\/><br\/>Secrets rolls cheekily into the ear drums and for the first half of the second track on the EP it feels like Martyn almost dares to stroll into familiar territory. By the end you are wondering why he chose to start off in such formulaic fashion. As the track reaches its halfway point a beautifully eerie, hauntingly smooth collection of violins cascade over the listener, soothing and unnerving, pulling and teasing, providing a conflict over whether to dance or just stop and savour the moment. One of those rare moments in dance music when a track reaches its conclusion far too soon.<br/><br/>Forgiveness Step 3 sees Martyn return to what he’s best at - providing a veritable smorgasbord of different auditory textures and rhythms. The trademark rolling drums contribute to a unique groove that’s bound to get the feet tapping and the heads nodding. Although not as strong as the other two tracks on the EP, Martyn builds the atmosphere subtly and as the EP draws to a close, one is left feeling uplifted and hungering for more. Overall this is a great EP and is perfect for those who want to get the crowd moving whilst also showing off their eclectic tastes.<br/><br/>Take a listen to the first two tracks via the soundcloud widget above.", "tagline":"A 70 minute journey through time..."}